Revit 2024 API
IFCLinkDocumentExportScope Members
The IFCLinkDocumentExportScope type exposes the following members.
Constructors
Name | Description
IFCLinkDocumentExportScope
 Instantiates a default IFCLinkDocumentExportScope object.
Methods
Name | Description
Dispose
Releases all resources used by the IFCLinkDocumentExportScope
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace